app/views/dishes/index.html.erb

SELECT "pictures".* FROM "pictures" WHERE "pictures"."dish_id" = 1 ORDER BY "pictures"."id" DESC LIMIT 1
---

    <div class="span4"><%= link_to image_tag(dish.pictures.last.url, :class => 'img-rounded') , dish%></div>