app/views/restaurants/index.html.erb

SELECT "pictures".* FROM "pictures" WHERE "pictures"."restaurant_id" = 1 LIMIT 1
---

    <div class="span4"><%= link_to image_tag(restaurant.pictures.first.url, :class => 'img-rounded') , restaurant%></div>