app/views/restaurants/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
---
  <b>Owner:</b>
  <%= User.find_by_id(@restaurant.user_id).name %>

SELECT "dishes".* FROM "dishes" WHERE "dishes"."restaurant_id" = 1
---
  <ul>
  <% @restaurant.dishes.each do |dish| %>