app/controllers/dishes_controller.rb

  def show
    @dish = Dish.find(params[:id])
---
SELECT "dishes".* FROM "dishes" WHERE "dishes"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @dish = Dish.find(params[:id])
---
SELECT "dishes".* FROM "dishes" WHERE "dishes"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @dish = Dish.new(params[:dish])

    respond_to do |format|
      if @dish.save
---
INSERT INTO "dishes" ("category_id", "created_at", "name", "price", "restaurant_id", "serves", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    @dish = Dish.find(params[:id])

    respond_to do |format|
      if @dish.update_attributes(params[:dish])
---
SELECT "dishes".* FROM "dishes" WHERE "dishes"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "dishes" SET "description" = 'A warm delicious pretzel served with spicy mustard', "updated_at" = '2013-03-03 19:29:09.995907' WHERE "dishes"."id" = 1