app/controllers/orders_controller.rb

  def index
    @orders = Order.where("user_id = ?", current_user.id)
---
SELECT "orders".* FROM "orders" WHERE (user_id = 5) ORDER BY order.updated_at DESC

  def create
    @order = Order.new(params[:order])

    #Set the user of the order to the current user
    @order.user_id = current_user.id

    respond_to do |format|
      if @order.save
---
INSERT INTO "orders" ("created_at", "event_address", "event_datetime", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)