app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders" ORDER BY updated_at DESC
---
  def index
    if current_user.role? :admin
      @orders = Order.order('updated_at DESC')