app/controllers/pictures_controller.rb

INSERT INTO "pictures" ("created_at", "dish_id", "restaurant_id", "updated_at", "url") VALUES (?, ?, ?, ?, ?)
---
  def create
    @picture = Picture.new(params[:picture])

    respond_to do |format|
      if @picture.save

SELECT "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "pictures" SET "url" = 'https://s3.amazonaws.com/kater.it/images/pretzel-4.jpg', "updated_at" = '2013-03-11 01:58:36.981430' WHERE "pictures"."id" = 2
---
  def update
    @picture = Picture.find(params[:id])

    respond_to do |format|
      if @picture.update_attributes(params[:picture])