app/controllers/restaurants_controller.rb

  def show
    @restaurant = Restaurant.find(params[:id].to_i)
---
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @restaurant = Restaurant.find(params[:id].to_i)
---
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @restaurant = Restaurant.new(params[:restaurant])

    #Assign the new restaurant with an owner_id of the person who created it
    @restaurant.user_id = current_user.id

    respond_to do |format|
      if @restaurant.save
---
INSERT INTO "restaurants" ("address", "created_at", "email", "name", "phone", "updated_at", "user_id", "website") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @restaurant = Restaurant.find(params[:id].to_i)

    respond_to do |format|
      if @restaurant.update_attributes(params[:restaurant])
---
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "restaurants" SET "website" = 'http://littlegoatchicago.com', "updated_at" = '2013-03-11 01:59:18.115844' WHERE "restaurants"."id" = 3