app/controllers/search_controller.rb

  def index

    @input = params[:term]

    @restaurants = Restaurant.where("name LIKE ?", "#{@input}%")

    @dishes = Dish.where("name LIKE ?", "#{@input}%")
---
SELECT "restaurants".* FROM "restaurants" WHERE (name LIKE 'g%')
SELECT "dishes".* FROM "dishes" WHERE (name LIKE 'p%')