app/controllers/users_controller.rb

  def index
    if current_user.role? :admin
      @users = User.all
---
SELECT "users".* FROM "users"

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
UPDATE "users" SET "name" = 'Mark', "updated_at" = '2013-02-17 21:25:31.931240' WHERE "users"."id" = 1